app/Controllers/AjaxController.php

SELECT *
FROM `kategori`
---
    public function index()
{
    // Ambil semua kategori
    $kategoriModel = new KategoriModel();
    $kategori = $kategoriModel->findAll();

SELECT *
FROM `kategori`
---
    public function getCategories()
{
    $model = new KategoriModel();
    $raw = $model->findAll();