app/Controllers/Artikel.php

    public function index()
    {
        $artikelModel  = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $rawKategori = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function admin_index()
    {
        $artikelModel  = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $rawKategori = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function edit($id)
    {
        $artikelModel  = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $artikel = $artikelModel->find($id);
        if (! $artikel) {
            throw PageNotFoundException::forPageNotFound("Artikel tidak ditemukan");
        }

        $kategori = $kategoriModel->findAll();
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '41'
SELECT *
FROM `kategori`

    public function update($id)
{
    $artikelModel  = new ArtikelModel();
    $artikel       = $artikelModel->find($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '41'

        'gambar'      => $fileName,
    ];

    $artikelModel->update($id, $data);
---
UPDATE `artikel` SET `judul` = 'zzzzzzzzzzzzz', `isi` = 'dddasddasdsdasdd', `slug` = 'zzzzzzzzzzzzz', `id_kategori` = '8', `gambar` = NULL, `updated_at` = '2025-07-09 14:03:01'
WHERE `artikel`.`id` IN ('41')

    public function delete($id)
    {
        $artikelModel = new ArtikelModel();
        $artikel = $artikelModel->find($id);

        if (! $artikel) {
            throw PageNotFoundException::forPageNotFound("Artikel tidak ditemukan");
        }

        if ($artikel['gambar'] && file_exists(ROOTPATH . 'public/uploads/' . $artikel['gambar'])) {
            unlink(ROOTPATH . 'public/uploads/' . $artikel['gambar']);
        }

        $artikelModel->delete($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '41'
DELETE FROM `artikel`
WHERE `id` IN ('41')