app/Models/Artikelmodel.php

SELECT `artikel`.*, `kategori`.`nama_kategori`, `artikel`.`created_at`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
---
    public function getArtikelDenganKategori()
{
    return $this->db->table('artikel')
        ->select('artikel.*, kategori.nama_kategori, artikel.created_at') // tambahkan ini
        ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
        ->get()
        ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `created_at` DESC
 LIMIT 4
---
    public function getPaginatedArtikel($perPage, $kategori = null, $q = null)
    {
        if ($kategori || $q) {
            $this->select('artikel.*, kategori.nama_kategori')
                 ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
                 ->orderBy('created_at', 'DESC');

            if ($kategori) {
                $this->where('artikel.id_kategori', $kategori);
            }

            if ($q) {
                $this->like('artikel.judul', $q);
            }
        } else {
            $this->select('artikel.*, kategori.nama_kategori')
                 ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
                 ->orderBy('created_at', 'DESC');
        }

        return $this->paginate($perPage, 'group1');